功能: 競賽活動系統管理
  為了能管理競賽活動的建立與設定
  身為系統管理者
  我要能建立競賽活動並修改相關資料

  場景大綱: 建立競賽活動
    假設< 我是系統管理者
    當< 我輸入競賽活動名稱<競賽活動名稱>
    而且< 輸入競賽活動管理帳號<競賽活動管理帳號>
    而且< 競賽活動管理密碼<競賽活動管理密碼>
    而且< 競賽活動管理 email <競賽活動管理 email>
    那麼< 競賽活動會被建立

    例子:
      |   競賽活動名稱   | 競賽活動管理帳號 | 競賽活動管理密碼 |      競賽活動管理 email     |
      | 自由軟體海報競賽  |      123      |      456     |  webmaster@bjes.tp.edu.tw |
  
  場景: 修改競賽活動
    假設< 我是系統管理者
    當< 我修改競賽活動資料
    那麼< 競賽活動資料將被修改
  
  場景: 刪除競賽活動
    假設< 我是系統管理者
    當< 我刪除競賽活動資料
    那麼< 競賽活動將被刪除